# Task 1 =================================================================================

# ТЗ: Сформировать массив из элементов арифметической прогрессии
# с заданным первым элементом x и разностью d.

# Developer notes: Испльзуйте range() и for

# Входные данные:
# длинна массива = 47
# x = 4
# d = 2
# ========================================================================================



# Task 2 =================================================================================

# ТЗ: # Найти количество четных чисел в массиве.

# Developer notes: Испльзуйте for

# Входные данные:
# input_list = [1, 54, 23, 678, 23, 2322, 798, 34, 22, 1, 23, 54, 45, 67]
# ========================================================================================



# Task 3 =================================================================================

# ТЗ: Определите, каких чисел в массиве больше:
# которые делятся (без остатка) на первый элемент массива или
# которые делятся (без остатка) на последний элемент массива.

# Developer notes: Испльзуйте for

# Входные данные:
# input_list = [3, 54, 23, 678, 15, 2322, 798, 34, 33, 1, 23, 54, 45, 2]
# ========================================================================================



# Task 4 =================================================================================

# ТЗ: Создать массив, каждый элемент которого равен квадрату своего номера.

# Developer notes: Испльзуйте range() и for

# Входные данные:
# длинна массива = 20
# ========================================================================================



# Task 5 =================================================================================

# ТЗ: # Дан массив. Сформировать новый массив,
# в котором идут сначала отрицательные элементы, затем нули, затем положительные.

# Developer notes: Испльзуйте for

# Входные данные:
# input_list = [23, 65, 23, 0, 234, 0, -12, 0, 740, -13, -409, 0]
# ========================================================================================


# Task 5 =================================================================================

# ТЗ: Даны входные данные (номера страховых полисов клиентов двух больних (списки):
# Alchemilla Hospital и Brookhaven Hospital).
# Нужно выяснить:
# 1. Сколько клиентов посещают обе больницы
# 2. Сколько клиентов посещают только больницу Alchemilla Hospital
# 3. Сколько клиентов (уникальных страховых полисов) находится в базах данных всех больниц
# Input data: al_hospital = [123, 4325, 3567, 234, 54647, 5663]
# Input data: bh_hospital = [688, 5653, 123, 56778, 234, 4677, 8787]
# # To solve with and without sets

# Developer notes: Решить не применяя set ! :)
# ========================================================================================






