# Task 1 =================================================================================

# ТЗ: Дано четырехзначное число. Верно ли, что цифры в нем расположены по убыванию?
# Например, 4311 - нет, 4321 - да, 5542 - нет, 5631 - нет, 9871 - да.

# Developer notes: В Python число можно "превратить" в строку с помощью функции str()
# Строку можно итерировать циклом FOR. Используйте его.
# ========================================================================================



# Task 2 =================================================================================

# ТЗ: В строке текста записаны слова, разделенные пробелами в произвольном количестве.
# Сжатие текста состоит в том, что между словами остается по одному пробелу,
# а после последнего слова пробелы удаляются (пробелы перед первым словом сохраняются).
# Если строка содержит только пробелы, то все они сохраняются.

# Developer notes: Для выполнения данной задачи используйте циклы.
# У строк есть методы "some_string".strip(), "some_string".lstrip(), "some_string".rstrip()
# они позволяют избавляться от пробелов в строках. Используйте этот инструментарий.
# Можете и спользовать конкатенацию строк.

# Входные данные:
# test_str_1 = "  Hello world   this is   me   "
# test_str_2 = "Hello world   this is   me again   "
# test_str_3 = "      "
# test_str_4 = "   Hello world   this is  not actually me   :)"

# На выходе должно быть:
# test_str_1 = "  Hello world this is me"
# test_str_2 = "Hello world this is me again"
# test_str_3 = "      "
# test_str_4 = "   Hello world this is not actually me :)"
# ========================================================================================



# Task 3 =================================================================================

# ТЗ: Создать программу, которая будет подсчитывать, достаточен ли доход пользователя,
# что бы прожить определенный срок в определенной стране.

# Developer notes: Тут специально дано неполное и невнятное ТЗ.
# Ваша задача, перед тем как приступить к решению, задать все необходимые вопросы
# "заказчику". А после, основываясь на ответах, приступить к решению.
# ========================================================================================